vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F491x3_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2"
  xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Holtek</vendor>
  <url>https://mcu.holtek.com.tw/pack</url>
  <name>HT32F491x3_DFP</name>
  <description>Holtek HT32F491x3 Series Device Support</description>
  <releases>
    <release version="1.0.4" date="2025-02-26">
      Update F/W Library
    </release>
    <release version="1.0.3" date="2024-01-17">
      Update information.
    </release>
    <release version="1.0.2" date="2023-11-08">
      Update information.
    </release>
    <release version="1.0.1" date="2023-10-16">
      Update the device name of flash loader.
    </release>
    <release version="1.0.0" date="2023-10-06">
      First Release version of HT32F491x3 Device Family Pack.
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>Holtek</keyword>
    <keyword>Device Support</keyword>
    <keyword>HT32F491x3</keyword>
    <keyword>HT32F491</keyword>
    <keyword>HT32</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M4  ********************** -->
    <family Dfamily="HT32F491xx Series" Dvendor="Holtek:106">
      <!--book name="Device/ARM/Documents/??_dgug.pdf" title="?? Device Generic Users Guide"/-->
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dtz="NO_TZ" Dendian="Little-endian" />
      <compile header="Device/Include/ht32f491x3.h"/>

      <description>
HT32F491x3 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
HT32F491x3 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
      </description>

      <!-- ************************  Subfamily 'HT32F49153/49163'  **************************** -->
      <subFamily DsubFamily="HT32F49153/49163">
        <processor Dfpu="1" Dclock="150000000"/>
        <debug svd="SVD/HT32F491x3.svd"/>
        <description>
HT32F491x3 - ARM Cortex-M4 Core
  Frequency up to 150 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 68 external interrupts, each has 16 priority levels

Memories
  Flash size up to 256 KB
  SRAM size up to 48KB

Low power management
  Power saving mode: sleep,deep-sleep and standby mode
  Independent battery supply for real-calendar RTC and battry powered domain register

Advanced analog peripherals
  Up to 1 x 12bit ADC

Integrated peripherals interface
  Up to 8 x USART/UART/Irda/LIN/ISO7816
  Up to 3 x SPI
  Up to 3 x I2C

On-chip resources
  Up to 1 x 16 bit Advanced Timer, 1 x SysTick Timer, 8 x 16 bit GPTM, 1 x 32 bit GPTM, 2 x WDT, 1 x ERTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HICK (8MHz), LICK (40KHz)
        </description>

        <feature type="WDT" n="2"/>
        <feature type="RTC" n="32768"/>
        <feature type="ADC" n="1" m="12"/>
        <feature type="Temp" n="-40" m="105"/>
        <feature type="VCC" n="2.40" m="3.60"/>

        <!-- *************************  Device 'HT32F49153_32QFN'  ***************************** -->
        <device Dname="HT32F49153_32QFN">
          <compile header="Device/Include/ht32f491x3.h" define="USE_HT32F49153_32QFN"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000"       init   ="0" default="1"/>
          <algorithm name="Flash/HT32F491x3_128.FLM" start="0x08000000" size="0x20000" default="1"/>
          <algorithm name="Flash/HT32F491x3_BOOTMEM_AP.FLM" start="0x1FFFA400" size="0x05000" default="0"/>
          <algorithm name="Flash/HT32F491x3_USD.FLM" start="0x1FFFF800" size="0x00200" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49163_32QFN'  ***************************** -->
        <device Dname="HT32F49163_32QFN">
          <compile header="Device/Include/ht32f491x3.h" define="USE_HT32F49163_32QFN"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000"       init   ="0" default="1"/>
          <algorithm name="Flash/HT32F491x3_256.FLM" start="0x08000000" size="0x40000" default="1"/>
          <algorithm name="Flash/HT32F491x3_BOOTMEM_AP.FLM" start="0x1FFFA400" size="0x05000" default="0"/>
          <algorithm name="Flash/HT32F491x3_USD.FLM" start="0x1FFFF800" size="0x00200" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49153_48LQFP'  ***************************** -->
        <device Dname="HT32F49153_48LQFP">
          <compile header="Device/Include/ht32f491x3.h" define="USE_HT32F49153_48LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000"       init   ="0" default="1"/>
          <algorithm name="Flash/HT32F491x3_128.FLM" start="0x08000000" size="0x20000" default="1"/>
          <algorithm name="Flash/HT32F491x3_BOOTMEM_AP.FLM" start="0x1FFFA400" size="0x05000" default="0"/>
          <algorithm name="Flash/HT32F491x3_USD.FLM" start="0x1FFFF800" size="0x00200" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49163_48LQFP'  ***************************** -->
        <device Dname="HT32F49163_48LQFP">
          <compile header="Device/Include/ht32f491x3.h" define="USE_HT32F49163_48LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000"       init   ="0" default="1"/>
          <algorithm name="Flash/HT32F491x3_256.FLM" start="0x08000000" size="0x40000" default="1"/>
          <algorithm name="Flash/HT32F491x3_BOOTMEM_AP.FLM" start="0x1FFFA400" size="0x05000" default="0"/>
          <algorithm name="Flash/HT32F491x3_USD.FLM" start="0x1FFFF800" size="0x00200" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49153_64LQFP'  ***************************** -->
        <device Dname="HT32F49153_64LQFP">
          <compile header="Device/Include/ht32f491x3.h" define="USE_HT32F49153_64LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000"       init   ="0" default="1"/>
          <algorithm name="Flash/HT32F491x3_128.FLM" start="0x08000000" size="0x20000" default="1"/>
          <algorithm name="Flash/HT32F491x3_BOOTMEM_AP.FLM" start="0x1FFFA400" size="0x05000" default="0"/>
          <algorithm name="Flash/HT32F491x3_USD.FLM" start="0x1FFFF800" size="0x00200" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49163_64LQFP'  ***************************** -->
        <device Dname="HT32F49163_64LQFP">
          <compile header="Device/Include/ht32f491x3.h" define="USE_HT32F49163_64LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000"       init   ="0" default="1"/>
          <algorithm name="Flash/HT32F491x3_256.FLM" start="0x08000000" size="0x40000" default="1"/>
          <algorithm name="Flash/HT32F491x3_BOOTMEM_AP.FLM" start="0x1FFFA400" size="0x05000" default="0"/>
          <algorithm name="Flash/HT32F491x3_USD.FLM" start="0x1FFFF800" size="0x00200" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49153_100LQFP'  ***************************** -->
        <device Dname="HT32F49153_100LQFP">
          <compile header="Device/Include/ht32f491x3.h" define="USE_HT32F49153_100LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000"       init   ="0" default="1"/>
          <algorithm name="Flash/HT32F491x3_128.FLM" start="0x08000000" size="0x20000" default="1"/>
          <algorithm name="Flash/HT32F491x3_BOOTMEM_AP.FLM" start="0x1FFFA400" size="0x05000" default="0"/>
          <algorithm name="Flash/HT32F491x3_USD.FLM" start="0x1FFFF800" size="0x00200" default="0"/>
        </device>

        <!-- *************************  Device 'HT32F49163_100LQFP'  ***************************** -->
        <device Dname="HT32F49163_100LQFP">
          <compile header="Device/Include/ht32f491x3.h" define="USE_HT32F49163_100LQFP"/>
          <memory id="IROM1" access="rx" start="0x08000000" size="0x20000" startup="1" default="1"/>
          <memory id="IRAM1" access="rw" start="0x20000000" size="0xC000"       init   ="0" default="1"/>
          <algorithm name="Flash/HT32F491x3_256.FLM" start="0x08000000" size="0x40000" default="1"/>
          <algorithm name="Flash/HT32F491x3_BOOTMEM_AP.FLM" start="0x1FFFA400" size="0x05000" default="0"/>
          <algorithm name="Flash/HT32F491x3_USD.FLM" start="0x1FFFF800" size="0x00200" default="0"/>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="HT32F491x3">
      <description>Holtek HT32F491x3 Devices</description>
      <require Dvendor="Holtek:106" Dname="HT32F491*3*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <condition id="HT32F491x3 ARMCC">
      <description>Holtek HT32F491x3xx Series devices</description>
      <require Dvendor="Holtek:106" Dname="HT32F491*3*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="HT32F491x3 CMSIS">
      <description>Holtek HT32F491x3 Devices and CMSIS-CORE</description>
      <require condition="HT32F491x3"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="ht32f491x3_conf"/>
      <require Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="crm"/>
    </condition>

    <!-- HT32F491x3 STDPERIPHERALS CRM Conditions -->
    <condition id="HT32F491x3 STDPERIPHERALS CRM">
      <description>Holtek HT32F491x3 Standard Peripherals Drivers with CRM</description>
      <require condition="HT32F491x3 CMSIS"/>
      <require Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="crm"/>
    </condition>

