vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F491x3_DFP.pdsc
    <!-- HT32F491x3 STDPERIPHERALS MISC Conditions -->
    <condition id="HT32F491x3 STDPERIPHERALS MISC">
      <description>Holtek  HT32F491x3 Standard Peripherals Drivers with MISC</description>
      <require condition="HT32F491x3 CMSIS"/>
      <require Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="misc"/>
    </condition>

    <!-- HT32F491x3 STDPERIPHERALS EVAL Conditions -->
    <condition id="HT32F491x3 STDPERIPHERALS EVB">
      <description>Holtek HT32F491x3 Standard Peripherals Drivers with EVB</description>
      <require condition="HT32F491x3 CMSIS"/>
      <require Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="gpio"/>
      <require Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="exint"/>
      <require Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="usart"/>
      <require Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="scfg"/>
    </condition>
  </conditions>

  <components>
    <!-- ht32f491x3_firmware_library -->
    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="acc" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Auto Clock Calibration (ACC) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ACC
      </RTE_Components_h>
      <files>
        <!-- ACC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_acc.h"/>
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_acc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="adc" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Analog-to-digital converter (ADC) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
      </RTE_Components_h>
      <files>
        <!-- ADC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_adc.h"/>
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_adc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="can" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>CAN (CAN) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
      </RTE_Components_h>
      <files>
        <!-- CAN file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_can.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_can.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="crc" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Cyclic Redundancy Check (CRC) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
      </RTE_Components_h>
      <files>
        <!-- CRC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_crc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_crc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="crm" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS MISC">
      <description>Clock and Reset Management (CRM) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRM
      </RTE_Components_h>
      <files>
        <!-- CRM file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_crm.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_crm.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="dac" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Digital-to-Analog-to converter (DAC) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
      </RTE_Components_h>
      <files>
        <!-- DAC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_dac.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_dac.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="debug" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Debug (DEBUG) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DEBUG
      </RTE_Components_h>
      <files>
        <!-- DEBUG file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_debug.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_debug.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="dma" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Direct Memory Access (DMA) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
      </RTE_Components_h>
      <files>
        <!-- DMA file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_dma.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_dma.c" attr="config" version="1.0.0" />
      </files>
    </component>

