vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F491x3_DFP.pdsc
    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="ertc" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Enhance Real-time Clock (ERTC) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ERTC
      </RTE_Components_h>
      <files>
        <!-- ERTC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_ertc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_ertc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="exint" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>External Interrupt/Event (EXINT) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXINT
      </RTE_Components_h>
      <files>
        <!-- EXINT file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_exint.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_exint.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="flash" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Flash Memory Controller (FLASH) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FLASH
      </RTE_Components_h>
      <files>
        <!-- FLASH file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_flash.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_flash.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="gpio" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
      </RTE_Components_h>
      <files>
        <!-- GPIO file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_gpio.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_gpio.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="i2c" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Inter-integrated Circuit (I2C) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
      </RTE_Components_h>
      <files>
        <!-- I2C file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_i2c.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_i2c.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="misc" Cversion="1.0.0" condition="HT32F491x3 CMSIS">
      <description>MISC driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
      </RTE_Components_h>
      <files>
        <!-- MISC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_misc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_misc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="pwc" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Power Control Unit(PWC) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PWC
      </RTE_Components_h>
      <files>
        <!-- PWC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_pwc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_pwc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="spi" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
      </RTE_Components_h>
      <files>
        <!-- SPI file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_spi.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_spi.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="scfg" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>System config (SCFG) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SCFG
      </RTE_Components_h>
      <files>
        <!-- SPI file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_scfg.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_scfg.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="tmr" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>TMR driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMR
      </RTE_Components_h>
      <files>
        <!-- TIMER file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_tmr.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_tmr.c" attr="config" version="1.0.0" />
      </files>
    </component>

