vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Holtek.HT32F491x3_DFP.pdsc
    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="usart" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
      </RTE_Components_h>
      <files>
        <!-- USART file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_usart.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_usart.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="usb" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Universal Serial Bus driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USB
      </RTE_Components_h>
      <files>
        <!-- USART file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_usb.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_usb.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="wdt" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Watchdog timer(WDT) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WDT
      </RTE_Components_h>
      <files>
        <!-- WDT file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_wdt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_wdt.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="wwdt" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>Window Watchdog Timer (WWDT) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDT
      </RTE_Components_h>
      <files>
        <!-- WWDT file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_wwdt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_wwdt.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="ht32f491x3_firmware_library" Csub="xmc" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS CRM">
      <description>External Memory Controller (XMC) driver for HT32F491x3 Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_XMC
      </RTE_Components_h>
      <files>
        <!-- XMC file -->
        <file category="header" name="Device/Firmware/Peripherals/inc/ht32f491x3_xmc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/ht32f491x3_xmc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <!-- Utilities HT32F491x3 -->
    <component Cclass="Device" Cgroup="evb" Csub="ht32f49163_sk" Cversion="1.0.0" condition="HT32F491x3 STDPERIPHERALS EVB">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/ht32f491x3_board.h" />
        <!-- evb file -->
        <file category="source" name="Device/Utilities/ht32f491x3_board.c" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Config HT32F491x3 -->
    <component Cclass="Device" Cgroup="ht32f491x3_conf" Cversion="1.0.0" condition="HT32F491x3 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/ht32f491x3_conf.h" attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup HT32F491x3  -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="HT32F491x3">
      <description>System startup for Holtek HT32F491x3 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/ht32f491x3.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_ht32f491x3.s" attr="config" version="1.0.0" condition="HT32F491x3 ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_ht32f491x3.c" attr="config" version="1.0.0"/>
      </files>
    </component>
  </components>
</package>
